import React from 'react';
import Link from 'next/link';
import Image from 'next/image';

import styles from '../styles/cards.module.css';
import fonts from '../styles/fonts.module.css'

import cardPicPool from '../public/images/leisure/l_2.webp';
import cardPicKinder from '../public/images/leisure/l_1.webp';

export const CardCommon = () => {
  return (
    <div className={styles.card_main}>
      <div className={styles.card_content}>
        <h2 className={`${styles.crd_head} ${fonts.dancing}`}>Анита</h2>
        <h3>гостевой дом с бассейном</h3>
        <div className={styles.crd_txt}>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M771 905 531 665l46-46 240 240q10 10 10 23t-10 23q-10 10-23 10t-23-10Zm-572-54q-40-54-59.5-116T120 610q0-78 29-152t88-133q59-59 133.5-88T523 208q63 0 124.5 19T763 286q13 10 14 26t-11 28L252 854q-12 12-27.5 11T199 851Zm28-58 69-70q-16-22-32-47.5t-29.5-54Q221 593 212 562.5T200 500q-27 74-18.5 151T227 793Zm117-115 246-248q-46-36-93.5-56.5t-90.5-27q-43-6.5-76.5 0T278 371q-18 18-23 51.5t2.5 75q7.5 41.5 29 88T344 678Zm363-363q-66-42-143.5-49T412 288q30 3 59.5 12t58 21.5q28.5 12.5 55 28.5t50.5 34l72-69Z" /></svg>
            <div><strong>Пляж, парк</strong> – 15-20 минут ходьбы спокойным шагом</div>
          </div>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M118 925q-14 7-26-2t-12-26q0-9 6.5-17.5T104 867q24-8 43.5-21t57.5-13q46 0 75 21.5t67 21.5q38 0 62.5-21.5T480 833q46 0 75 21.5t67 21.5q38 0 63-21.5t71-21.5q38 0 57.5 13t42.5 21q11 4 17.5 12t6.5 18q0 17-12 26t-26 2q-20-10-40-20.5T756 894q-38 0-65 21t-69 21q-42 0-73-21t-69-21q-38 0-66.5 21T343 936q-42 0-71-21t-67-21q-26 0-46 10.5T118 925Zm-3-187q-14 6-24.5-2.5T80 711q0-9 6-16.5t16-10.5q25-8 45-21t58-13q46 0 73 19t65 19q38 0 64.5-19t72.5-19q46 0 73 19t65 19q38 0 65-19t73-19q38 0 58 13t44 21q10 3 16 10.5t6 16.5q0 16-10.5 24.5T845 738q-21-10-41.5-21T756 706q-38 0-65 21t-69 21q-42 0-73-21t-69-21q-38 0-64.5 21T347 748q-42 0-73-21t-69-21q-27 0-48 11t-42 21Zm228-173q-18 0-32.5-7T288 540l135-135-54-54q-27-27-54.5-40T249 295q-16-2-27-13t-11-27q0-17 11.5-28.5T251 217q54 5 93 23t76 55l253 253q-11 9-25.5 13t-29.5 4q-38 0-65.5-21T480 523q-45 0-72 21t-65 21Zm325-156q-40 0-67.5-27.5T573 314q0-40 27.5-67.5T668 219q40 0 67.5 27.5T763 314q0 40-27.5 67.5T668 409Z" /></svg>
            <div>Бассейн – открытый с подогревом, две зоны (для детей и взрослых)</div>
          </div>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M280 976q-14 0-21-11.5t-2-24.5l36-83q-17-12-30.5-23.5T235 808q-8 4-17.5 6t-17.5 2q-32 0-54.5-22.5T123 739q0-20 9.5-37.5T156 676q-7-25-11-50t-4-51q0-27 3.5-51.5T156 474q-14-10-23.5-26.5T123 411q0-32 22.5-54.5T200 334q8 0 17 2t17 6q35-36 76.5-60t92.5-37q5-32 26.5-50.5T480 176q29 0 51 19t26 50q51 13 96 34.5t79 59.5q7-2 14-3.5t14-1.5q32 0 54.5 22.5T837 411q0 22-9.5 38T804 474q8 26 11.5 50t3.5 51q0 26-3.5 50.5T804 675q17 11 25 29t8 35q0 32-22.5 54.5T760 816q-8 0-17.5-2t-16.5-6q-13 14-27 26t-30 23l36 83q5 13-2.5 24.5T680 976q-8 0-14.5-4t-9.5-11l-35-77q-17 6-32 11t-32 10q-5 33-26.5 51T480 974q-29 0-50.5-18T403 905q-17-5-32.5-10T341 883l-37 78q-3 7-9.5 11t-14.5 4Zm35-170 71-155q-14-16-21-34.5t-7-40.5q0-50 37.5-86t87.5-36q50 0 84.5 36t34.5 86q0 22-6.5 40.5T574 651l71 155q11-8 22.5-17.5T689 768q-2-6-4-13.5t-2-15.5q0-27 18-49t50-28q7-20 10.5-42t3.5-45q0-24-3.5-45.5T752 488q-30-4-49.5-26T683 411q0-9 1.5-16t4.5-15q-32-31-67-51t-79-32q-8 13-24.5 23T480 330q-22 0-38-10t-25-23q-44 12-80.5 32T271 382q4 8 5 14.5t1 14.5q0 32-20.5 52.5T209 488q-7 20-10.5 41.5T195 575q0 23 3.5 45t10.5 42q32 6 50 28t18 49q0 9-1.5 16t-3.5 12q10 11 20.5 20.5T315 806Zm45 27q12 5 26.5 10.5T417 853q11-14 26-23.5t37-9.5q22 0 38.5 9.5T543 853q17-4 30.5-9t24.5-10l-65-151q-12 8-26 11.5t-28 3.5q-14 0-28-4t-26-12l-65 151Zm120-195q26 0 44-18t18-44q0-26-18-44t-44-18q-26 0-44 18t-18 44q0 26 18 44t44 18Zm0-62Z" /></svg>
            <div>Столовые, магазины, рынок, аквапарк «Наутилус» - 2-7 минут ходьбы спокойным шагом</div>
          </div>

        </div>
        <div className={styles.card_cont__btn}>

          <Link href={'./services'}>
            <button>Узнай больше</button>
          </Link>
        </div>
      </div>
      <Image src={cardPicPool} alt='территория с бассейном' className={styles.card_media} />
    </div>
  )
}

export const CardService = () => {
  return (
    <div className={styles.card_main}>
      <div className={styles.card_content}>
        <h2 className={`${styles.crd_head} ${fonts.dancing}`}>Удобно расположен</h2>
        <h3>всё что нужно рядом</h3>
        <div className={styles.crd_txt}>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M480 976q-140-35-230-162.5T160 534V296l320-120 320 120v238q0 152-90 279.5T480 976Zm0-62q106-35 175.5-128.5T737 576H480V241l-260 97v196q0 12 .5 20.5T223 576h257v338Z" /></svg>
            <div>закрытая территория</div>
          </div>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M584 554q-19 0-32-13t-13-32q0-19 13-32t32-13q19 0 32 13t13 32q0 19-13 32t-32 13Zm-209 0q-19 0-32-13t-13-32q0-19 13-32t32-13q19 0 32 13t13 32q0 19-13 32t-32 13Zm105 216q-56 0-102-30t-72-79h348q-26 49-72 79t-102 30Zm0 166q-74 0-139.5-28.5T226 830q-49-49-77.5-114.5T120 576q0-74 28.5-139.5T226 322q49-49 114.5-77.5T480 216q74 0 139.5 28.5T734 322q49 49 77.5 114.5T840 576q0 74-28.5 139.5T734 830q-49 49-114.5 77.5T480 936Zm0-60q123 0 211.5-87.5T780 578q0-123-87-215t-215-92h-18q-7 0-18 1-2 8-3.5 19t-1.5 19q0 25 16.5 41.5T495 368q12 0 20-1.5t15-1.5q10 0 17 5t7 15q0 16-15 24.5t-44 8.5q-46 0-77-31t-31-77q0-5 .5-13t2.5-13q-91 33-150.5 110T180 574q0 123 88.5 212.5T480 876Zm0-302Z" /></svg>
            <div>Детская площадка</div>
          </div>
          <div className={styles.crd_txt__el}>
            <svg xmlns="http://www.w3.org/2000/svg" height="24" viewBox="0 96 960 960" width="24"><path d="M318 863h50V585q29-4 49.5-26.5t20.5-51.82V353q0-10-7.2-16.5T414 330q-10 0-16.5 6.5t-6.5 16.13V473h-22V352.63q0-9.63-6.5-16.13Q356 330 346 330t-16.5 6.5q-6.5 6.5-6.5 16.13V473h-29V352.63q0-9.63-6.5-16.13Q281 330 271 330t-16.5 6.5Q248 343 248 353v153.68q0 29.32 20 51.82t50 26.5v278Zm253 0h50V597q35-14 55-49.897 20-35.898 20-84.103 0-57-27.703-95t-69.5-38Q557 330 530 368t-27 95q0 51 18 86t50 48v266ZM140 976q-24 0-42-18t-18-42V236q0-24 18-42t42-18h680q24 0 42 18t18 42v680q0 24-18 42t-42 18H140Zm0-60h680V236H140v680Zm0 0V236v680Z" /></svg>
            <div>Кухня и обеденная зона для самостоятельного приготовления пищи</div>
          </div>

        </div>
        <div className={styles.card_cont__btn}>

          <Link href={'./services'}>
            <button>Узнай больше</button>
          </Link>
        </div>
      </div>
      <Image src={cardPicKinder} alt='территория с бассейном' className={styles.card_media} />
    </div>
  )
}